// Напишите программу, которая на вход примает число и выдает его квадрат


Console.WriteLine("Write a number: ");
int num = int.Parse(Console.ReadLine()!);


Console.WriteLine(num*num);