<<<<<<< HEAD
﻿// Напишите программу, которая принимает на
//вход число (N) и выдаёт таблицу кубов чисел от 1 до N.


Console.Write("Введите число N = ");


void Pow(int N)
{
    int i =1;
    while (i <= N)
    {
        Console.WriteLine(Math.Pow(i,3));
        i++;
    }
}

int N = int.Parse(Console.ReadLine()!);
Pow(N);
=======
﻿
>>>>>>> 4_lesson
