// Задайте значения M и N. Напишите программу, которая найдет сумму 
// натуральных элементов в промежутке от M до N с помощью рекурсии.

Console.Write("Введите число M = ");
int M = int.Parse(Console.ReadLine()!);

Console.Write("Введите число N = ");
int N = int.Parse(Console.ReadLine()!);

double SumNums (int a, int b)
{
    if (a==0 && b==0) return ;
}


SumNums(M,N);